In [59]:
import pandas as pd

In [60]:
test_series = pd.Series(['a','b','c','d','e'])
test_series

0    a
1    b
2    c
3    d
4    e
dtype: object

# Series

In [61]:
s1 = pd.Series(['smile','love','peace'])

In [62]:
s1

0    smile
1     love
2    peace
dtype: object

In [63]:
import numpy as np

s2 = pd.Series(np.arange(5), index = ['a','b','c','d','e'])
s2

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [64]:
s3_dict = {'name': 'Tom', 'age':29, 'sex':1}
s3 = pd.Series(s3_dict)
s3

name    Tom
age      29
sex       1
dtype: object

In [65]:
import numpy as np
s4 = pd.Series (np.arange(10))
print(s4)
s4[s4>5]

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

6    6
7    7
8    8
9    9
dtype: int32

In [66]:
s2 = pd.Series (np.arange(5), index = ['a','b','c','d','e'])
print(s2['a'])
print()
print(s2[['a','b','c']]) # 여러 개의 값을 indexing할 때에는 리스트로 넣어줌

0

a    0
b    1
c    2
dtype: int32

In [67]:
s4 = pd.Series(np.arange(10))
print(s4)
s4[s4>5]

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

6    6
7    7
8    8
9    9
dtype: int32

In [68]:
s4 = s4*2
s4

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int32

In [69]:
s5 = pd.Series([1,2,np.nan], index= ['a','b','c'])
s5

a    1.0
b    2.0
c    NaN
dtype: float64

In [70]:
s5.values

array([ 1.,  2., nan])

In [71]:
type(s5.values)

numpy.ndarray

In [72]:
s5.index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
pd.isnull(s5)

a    False
b    False
c     True
dtype: bool

In [74]:
s6 = pd.Series([1,2,3], index =['a','b','c']) #인덱스가 같아야 연산이 가능 / 인덱스가 같지 않을 경우 널값과 연산이되어 널값이 나옴
s5 + s6

a    2.0
b    4.0
c    NaN
dtype: float64

# Dataframe

# Dataframe 생성
pd.DataFrame()함수를 이용하여 생성
-row와 column에 대해 index가 존재
 _ column에 대한 index는 변수명이라고 생각하면 된다.
 -각 column(즉, Series)은 각기 다른 데이터 타입을 가질 수 있다.
 _Dataframe은 여러 Series가 모여서 만든 것으로 생각하면 된다.

In [75]:
player_dict = {'이름' : ['류현진','김연아','손흥민'], '종목': ['야구','피겨','축구'], '나이' : [29,25,26]}
player_df = pd.DataFrame(player_dict, index = {'선수1','선수2','선수3'})
player_df

      이름  종목  나이
선수2  류현진  야구  29
선수3  김연아  피겨  25
선수1  손흥민  축구  26

In [76]:
player_df['이름']

선수2    류현진
선수3    김연아
선수1    손흥민
Name: 이름, dtype: object

In [77]:
type(player_df['이름'])

pandas.core.series.Series

In [78]:
player_df[['나이','이름']] # 2개 이상일 경우 리스트의 형태로 넣어주어야 함

     나이   이름
선수2  29  류현진
선수3  25  김연아
선수1  26  손흥민

In [79]:
type(player_df[['나이','이름']])

pandas.core.frame.DataFrame

In [80]:
player_df[0:2]

      이름  종목  나이
선수2  류현진  야구  29
선수3  김연아  피겨  25

In [81]:
player_df['이름'][0:2]

선수2    류현진
선수3    김연아
Name: 이름, dtype: object

# ioc & lioc

- loc : index이름으로 인덱싱

In [82]:
player_df.loc['선수1'] ##해당 row 선택

이름    손흥민
종목     축구
나이     26
Name: 선수1, dtype: object

In [83]:
player_df['이름'].loc['선수1']

'손흥민'

In [84]:
player_df[['이름','종목']]

      이름  종목
선수2  류현진  야구
선수3  김연아  피겨
선수1  손흥민  축구

In [85]:
player_df[['이름','종목']][:2]

      이름  종목
선수2  류현진  야구
선수3  김연아  피겨

In [86]:
player_df.iloc[1:]

      이름  종목  나이
선수3  김연아  피겨  25
선수1  손흥민  축구  26

In [87]:
player_df['종목'].iloc[:2]

선수2    야구
선수3    피겨
Name: 종목, dtype: object

In [88]:
player_df[['이름','종목']][:2]

      이름  종목
선수2  류현진  야구
선수3  김연아  피겨

In [89]:
player_df.iloc[:,1:3]

     종목  나이
선수2  야구  29
선수3  피겨  25
선수1  축구  26

# 컬럼 추가

In [90]:
player_df

      이름  종목  나이
선수2  류현진  야구  29
선수3  김연아  피겨  25
선수1  손흥민  축구  26

In [91]:
player_df['최고연봉'] = [110, 15,80]
player_df

      이름  종목  나이  최고연봉
선수2  류현진  야구  29   110
선수3  김연아  피겨  25    15
선수1  손흥민  축구  26    80

In [92]:
player_df[player_df['나이']>25]

      이름  종목  나이  최고연봉
선수2  류현진  야구  29   110
선수1  손흥민  축구  26    80

In [93]:
player_df['고액연봉'] = np.where(player_df['최고연봉']>50, 1, 0)

In [94]:
player_df

      이름  종목  나이  최고연봉  고액연봉
선수2  류현진  야구  29   110     1
선수3  김연아  피겨  25    15     0
선수1  손흥민  축구  26    80     1

# del

In [95]:
del player_df['고액연봉']
player_df

      이름  종목  나이  최고연봉
선수2  류현진  야구  29   110
선수3  김연아  피겨  25    15
선수1  손흥민  축구  26    80

In [96]:
player_df.drop(['나이', '최고연봉'], axis = 1)

      이름  종목
선수2  류현진  야구
선수3  김연아  피겨
선수1  손흥민  축구

In [97]:
player_df.drop('선수3')

      이름  종목  나이  최고연봉
선수2  류현진  야구  29   110
선수1  손흥민  축구  26    80

In [98]:
player_df

      이름  종목  나이  최고연봉
선수2  류현진  야구  29   110
선수3  김연아  피겨  25    15
선수1  손흥민  축구  26    80

# data Frame operation

In [99]:

df1 = pd.DataFrame({'a' : [0,3,6], 'b' : [1,4,7], 'c' : [2,5,8]})
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [100]:
s = pd.Series(np.arange(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [101]:
s.map(lambda x:x**2)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [102]:
def zero_one(x):
    result = np.where(x>2, 'a', 'b')
    return result

s.map(zero_one)

0    b
1    b
2    b
3    a
4    a
dtype: object

In [103]:
import pandas as pd
import numpy as np

In [104]:
change_dict = {0:'A', 1:'B', 2:'C'}
s.map(change_dict)

0      A
1      B
2      C
3    NaN
4    NaN
dtype: object

In [105]:
info_df = pd.DataFrame({'age':[30,25,25,12,40], 'height':[178,180,160,150,175], 'weight':[80,100,55,40,70]})
info_df

   age  height  weight
0   30     178      80
1   25     180     100
2   25     160      55
3   12     150      40
4   40     175      70

In [106]:
f = lambda x: 1 if x>=30 else 0
info_df['age_code'] = info_df['age'].map(f)
info_df

   age  height  weight  age_code
0   30     178      80         1
1   25     180     100         0
2   25     160      55         0
3   12     150      40         0
4   40     175      70         1

# apply
-map 함수와는 다르게 Series 전체를 대상으로 원하는 함수 적용
-axis 인자를 이용하여 원하는 축 방ㅇ향에 따라 함수 적용 가능

In [107]:
info_df

   age  height  weight  age_code
0   30     178      80         1
1   25     180     100         0
2   25     160      55         0
3   12     150      40         0
4   40     175      70         1

In [108]:
f_range = lambda x:x.max() - x.min()
info_df.apply(f_range)

age         28
height      30
weight      60
age_code     1
dtype: int64

In [109]:
info_df.apply(f_range, axis = 1)

0    177
1    180
2    160
3    150
4    174
dtype: int64

In [110]:
info_df.apply(f_range, axis = 0) # axis 0 은 생략해도 가능

age         28
height      30
weight      60
age_code     1
dtype: int64

# applymap
- dataFrame의 모든 elemens 에원하는 함수를 적용

In [111]:
info_df.applymap(lambda x:-x)

   age  height  weight  age_code
0  -30    -178     -80        -1
1  -25    -180    -100         0
2  -25    -160     -55         0
3  -12    -150     -40         0
4  -40    -175     -70        -1

# pandas DataFrame을 numpy ndarray로 변경하는법
-df.values

In [112]:
iris_df = pd.read_csv('iris.csv')

In [113]:
iris_df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [114]:
iris_mat = iris_df.values

In [115]:
iris_mat

array([[1, 5.1, 3.5, 1.4, 0.2, 'Iris-setosa'],
       [2, 4.9, 3.0, 1.4, 0.2, 'Iris-setosa'],
       [3, 4.7, 3.2, 1.3, 0.2, 'Iris-setosa'],
       [4, 4.6, 3.1, 1.5, 0.2, 'Iris-setosa'],
       [5, 5.0, 3.6, 1.4, 0.2, 'Iris-setosa'],
       [6, 5.4, 3.9, 1.7, 0.4, 'Iris-setosa'],
       [7, 4.6, 3.4, 1.4, 0.3, 'Iris-setosa'],
       [8, 5.0, 3.4, 1.5, 0.2, 'Iris-setosa'],
       [9, 4.4, 2.9, 1.4, 0.2, 'Iris-setosa'],
       [10, 4.9, 3.1, 1.5, 0.1, 'Iris-setosa'],
       [11, 5.4, 3.7, 1.5, 0.2, 'Iris-setosa'],
       [12, 4.8, 3.4, 1.6, 0.2, 'Iris-setosa'],
       [13, 4.8, 3.0, 1.4, 0.1, 'Iris-setosa'],
       [14, 4.3, 3.0, 1.1, 0.1, 'Iris-setosa'],
       [15, 5.8, 4.0, 1.2, 0.2, 'Iris-setosa'],
       [16, 5.7, 4.4, 1.5, 0.4, 'Iris-setosa'],
       [17, 5.4, 3.9, 1.3, 0.4, 'Iris-setosa'],
       [18, 5.1, 3.5, 1.4, 0.3, 'Iris-setosa'],
       [19, 5.7, 3.8, 1.7, 0.3, 'Iris-setosa'],
       [20, 5.1, 3.8, 1.5, 0.3, 'Iris-setosa'],
       [21, 5.4, 3.4, 1.7, 0.2, 'Iris-setosa'],
       [22, 5.1, 3.7, 1.5, 0.4, 'Iris-setosa'],
       [23, 4.6, 3.6, 1.0, 0.2, 'Iris-setosa'],
       [24, 5.1, 3.3, 1.7, 0.5, 'Iris-setosa'],
       [25, 4.8, 3.4, 1.9, 0.2, 'Iris-setosa'],
       [26, 5.0, 3.0, 1.6, 0.2, 'Iris-setosa'],
       [27, 5.0, 3.4, 1.6, 0.4, 'Iris-setosa'],
       [28, 5.2, 3.5, 1.5, 0.2, 'Iris-setosa'],
       [29, 5.2, 3.4, 1.4, 0.2, 'Iris-setosa'],
       [30, 4.7, 3.2, 1.6, 0.2, 'Iris-setosa'],
       [31, 4.8, 3.1, 1.6, 0.2, 'Iris-setosa'],
       [32, 5.4, 3.4, 1.5, 0.4, 'Iris-setosa'],
       [33, 5.2, 4.1, 1.5, 0.1, 'Iris-setosa'],
       [34, 5.5, 4.2, 1.4, 0.2, 'Iris-setosa'],
       [35, 4.9, 3.1, 1.5, 0.1, 'Iris-setosa'],
       [36, 5.0, 3.2, 1.2, 0.2, 'Iris-setosa'],
       [37, 5.5, 3.5, 1.3, 0.2, 'Iris-setosa'],
       [38, 4.9, 3.1, 1.5, 0.1, 'Iris-setosa'],
       [39, 4.4, 3.0, 1.3, 0.2, 'Iris-setosa'],
       [40, 5.1, 3.4, 1.5, 0.2, 'Iris-setosa'],
       [41, 5.0, 3.5, 1.3, 0.3, 'Iris-setosa'],
       [42, 4.5, 2.3, 1.3, 0.3, 'Iris-setosa'],
       [43, 4.4, 3.2, 1.3, 0.2, 'Iris-setosa'],
       [44, 5.0, 3.5, 1.6, 0.6, 'Iris-setosa'],
       [45, 5.1, 3.8, 1.9, 0.4, 'Iris-setosa'],
       [46, 4.8, 3.0, 1.4, 0.3, 'Iris-setosa'],
       [47, 5.1, 3.8, 1.6, 0.2, 'Iris-setosa'],
       [48, 4.6, 3.2, 1.4, 0.2, 'Iris-setosa'],
       [49, 5.3, 3.7, 1.5, 0.2, 'Iris-setosa'],
       [50, 5.0, 3.3, 1.4, 0.2, 'Iris-setosa'],
       [51, 7.0, 3.2, 4.7, 1.4, 'Iris-versicolor'],
       [52, 6.4, 3.2, 4.5, 1.5, 'Iris-versicolor'],
       [53, 6.9, 3.1, 4.9, 1.5, 'Iris-versicolor'],
       [54, 5.5, 2.3, 4.0, 1.3, 'Iris-versicolor'],
       [55, 6.5, 2.8, 4.6, 1.5, 'Iris-versicolor'],
       [56, 5.7, 2.8, 4.5, 1.3, 'Iris-versicolor'],
       [57, 6.3, 3.3, 4.7, 1.6, 'Iris-versicolor'],
       [58, 4.9, 2.4, 3.3, 1.0, 'Iris-versicolor'],
       [59, 6.6, 2.9, 4.6, 1.3, 'Iris-versicolor'],
       [60, 5.2, 2.7, 3.9, 1.4, 'Iris-versicolor'],
       [61, 5.0, 2.0, 3.5, 1.0, 'Iris-versicolor'],
       [62, 5.9, 3.0, 4.2, 1.5, 'Iris-versicolor'],
       [63, 6.0, 2.2, 4.0, 1.0, 'Iris-versicolor'],
       [64, 6.1, 2.9, 4.7, 1.4, 'Iris-versicolor'],
       [65, 5.6, 2.9, 3.6, 1.3, 'Iris-versicolor'],
       [66, 6.7, 3.1, 4.4, 1.4, 'Iris-versicolor'],
       [67, 5.6, 3.0, 4.5, 1.5, 'Iris-versicolor'],
       [68, 5.8, 2.7, 4.1, 1.0, 'Iris-versicolor'],
       [69, 6.2, 2.2, 4.5, 1.5, 'Iris-versicolor'],
       [70, 5.6, 2.5, 3.9, 1.1, 'Iris-versicolor'],
       [71, 5.9, 3.2, 4.8, 1.8, 'Iris-versicolor'],
       [72, 6.1, 2.8, 4.0, 1.3, 'Iris-versicolor'],
       [73, 6.3, 2.5, 4.9, 1.5, 'Iris-versicolor'],
       [74, 6.1, 2.8, 4.7, 1.2, 'Iris-versicolor'],
       [75, 6.4, 2.9, 4.3, 1.3, 'Iris-versicolor'],
       [76, 6.6, 3.0, 4.4, 1.4, 'Iris-versicolor'],
       [77, 6.8, 2.8, 4.8, 1.4, 'Iris-versicolor'],
       [78, 6.7, 3.0, 5.0, 1.7, 'Iris-versicolor'],
       [79, 6.0, 2.9, 4.5, 1.5, 'Iris-versicolor'],
       [80, 5.7, 2.6, 3.5, 1.0, 'Iris-versicolor'],
       [81, 5.5, 2.4, 3.8, 1.1, 'Iris-versicolor'],
       [82, 5.5, 2.4, 3.7, 1.0, 'Iris-versicolor'],
       [83, 5.8, 2.7, 3.9, 1.2, 'Iris-versicolor'],
       [84, 6.0, 2.7, 5.1, 1.6, 'Iris-versicolor'],
       [85, 5.4, 3.0, 4.5, 1.5, 'Iris-versicolor'],
       [86, 6.0, 3.4, 4.5, 1.6, 'Iris-versicolor'],
       [87, 6.7, 3.1, 4.7, 1.5, 'Iris-versicolor'],
       [88, 6.3, 2.3, 4.4, 1.3, 'Iris-versicolor'],
       [89, 5.6, 3.0, 4.1, 1.3, 'Iris-versicolor'],
       [90, 5.5, 2.5, 4.0, 1.3, 'Iris-versicolor'],
       [91, 5.5, 2.6, 4.4, 1.2, 'Iris-versicolor'],
       [92, 6.1, 3.0, 4.6, 1.4, 'Iris-versicolor'],
       [93, 5.8, 2.6, 4.0, 1.2, 'Iris-versicolor'],
       [94, 5.0, 2.3, 3.3, 1.0, 'Iris-versicolor'],
       [95, 5.6, 2.7, 4.2, 1.3, 'Iris-versicolor'],
       [96, 5.7, 3.0, 4.2, 1.2, 'Iris-versicolor'],
       [97, 5.7, 2.9, 4.2, 1.3, 'Iris-versicolor'],
       [98, 6.2, 2.9, 4.3, 1.3, 'Iris-versicolor'],
       [99, 5.1, 2.5, 3.0, 1.1, 'Iris-versicolor'],
       [100, 5.7, 2.8, 4.1, 1.3, 'Iris-versicolor'],
       [101, 6.3, 3.3, 6.0, 2.5, 'Iris-virginica'],
       [102, 5.8, 2.7, 5.1, 1.9, 'Iris-virginica'],
       [103, 7.1, 3.0, 5.9, 2.1, 'Iris-virginica'],
       [104, 6.3, 2.9, 5.6, 1.8, 'Iris-virginica'],
       [105, 6.5, 3.0, 5.8, 2.2, 'Iris-virginica'],
       [106, 7.6, 3.0, 6.6, 2.1, 'Iris-virginica'],
       [107, 4.9, 2.5, 4.5, 1.7, 'Iris-virginica'],
       [108, 7.3, 2.9, 6.3, 1.8, 'Iris-virginica'],
       [109, 6.7, 2.5, 5.8, 1.8, 'Iris-virginica'],
       [110, 7.2, 3.6, 6.1, 2.5, 'Iris-virginica'],
       [111, 6.5, 3.2, 5.1, 2.0, 'Iris-virginica'],
       [112, 6.4, 2.7, 5.3, 1.9, 'Iris-virginica'],
       [113, 6.8, 3.0, 5.5, 2.1, 'Iris-virginica'],
       [114, 5.7, 2.5, 5.0, 2.0, 'Iris-virginica'],
       [115, 5.8, 2.8, 5.1, 2.4, 'Iris-virginica'],
       [116, 6.4, 3.2, 5.3, 2.3, 'Iris-virginica'],
       [117, 6.5, 3.0, 5.5, 1.8, 'Iris-virginica'],
       [118, 7.7, 3.8, 6.7, 2.2, 'Iris-virginica'],
       [119, 7.7, 2.6, 6.9, 2.3, 'Iris-virginica'],
       [120, 6.0, 2.2, 5.0, 1.5, 'Iris-virginica'],
       [121, 6.9, 3.2, 5.7, 2.3, 'Iris-virginica'],
       [122, 5.6, 2.8, 4.9, 2.0, 'Iris-virginica'],
       [123, 7.7, 2.8, 6.7, 2.0, 'Iris-virginica'],
       [124, 6.3, 2.7, 4.9, 1.8, 'Iris-virginica'],
       [125, 6.7, 3.3, 5.7, 2.1, 'Iris-virginica'],
       [126, 7.2, 3.2, 6.0, 1.8, 'Iris-virginica'],
       [127, 6.2, 2.8, 4.8, 1.8, 'Iris-virginica'],
       [128, 6.1, 3.0, 4.9, 1.8, 'Iris-virginica'],
       [129, 6.4, 2.8, 5.6, 2.1, 'Iris-virginica'],
       [130, 7.2, 3.0, 5.8, 1.6, 'Iris-virginica'],
       [131, 7.4, 2.8, 6.1, 1.9, 'Iris-virginica'],
       [132, 7.9, 3.8, 6.4, 2.0, 'Iris-virginica'],
       [133, 6.4, 2.8, 5.6, 2.2, 'Iris-virginica'],
       [134, 6.3, 2.8, 5.1, 1.5, 'Iris-virginica'],
       [135, 6.1, 2.6, 5.6, 1.4, 'Iris-virginica'],
       [136, 7.7, 3.0, 6.1, 2.3, 'Iris-virginica'],
       [137, 6.3, 3.4, 5.6, 2.4, 'Iris-virginica'],
       [138, 6.4, 3.1, 5.5, 1.8, 'Iris-virginica'],
       [139, 6.0, 3.0, 4.8, 1.8, 'Iris-virginica'],
       [140, 6.9, 3.1, 5.4, 2.1, 'Iris-virginica'],
       [141, 6.7, 3.1, 5.6, 2.4, 'Iris-virginica'],
       [142, 6.9, 3.1, 5.1, 2.3, 'Iris-virginica'],
       [143, 5.8, 2.7, 5.1, 1.9, 'Iris-virginica'],
       [144, 6.8, 3.2, 5.9, 2.3, 'Iris-virginica'],
       [145, 6.7, 3.3, 5.7, 2.5, 'Iris-virginica'],
       [146, 6.7, 3.0, 5.2, 2.3, 'Iris-virginica'],
       [147, 6.3, 2.5, 5.0, 1.9, 'Iris-virginica'],
       [148, 6.5, 3.0, 5.2, 2.0, 'Iris-virginica'],
       [149, 6.2, 3.4, 5.4, 2.3, 'Iris-virginica'],
       [150, 5.9, 3.0, 5.1, 1.8, 'Iris-virginica']], dtype=object)

In [116]:
iris_mat[:4,:]

array([[1, 5.1, 3.5, 1.4, 0.2, 'Iris-setosa'],
       [2, 4.9, 3.0, 1.4, 0.2, 'Iris-setosa'],
       [3, 4.7, 3.2, 1.3, 0.2, 'Iris-setosa'],
       [4, 4.6, 3.1, 1.5, 0.2, 'Iris-setosa']], dtype=object)

In [117]:
iris_mat.shape

(150, 6)

In [118]:
iris_mat.ndim

2

In [119]:
iris_mat.size

900

# Unique

In [120]:
iris_df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [121]:
iris_df['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [122]:
iris_df.mean()

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

In [123]:
iris_df.mean(axis=1)

0       2.24
1       2.30
2       2.48
3       2.68
4       3.04
       ...
145    32.64
146    32.54
147    32.94
148    33.26
149    33.16
Length: 150, dtype: float64

In [124]:
iris_df.corr()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Id,1.000000,0.716676,-0.397729,0.882747,0.899759
SepalLengthCm,0.716676,1.000000,-0.109369,0.871754,0.817954
SepalWidthCm,-0.397729,-0.109369,1.000000,-0.420516,-0.356544
PetalLengthCm,0.882747,0.871754,-0.420516,1.000000,0.962757
PetalWidthCm,0.899759,0.817954,-0.356544,0.962757,1.000000

# sort_values()

DataFrame의 column값을 기준으로 sorting 시켜주는 함수

In [125]:
iris_df.sort_values('SepalLengthCm', ascending=False).head(5)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
131,132,7.9,3.8,6.4,2.0,Iris-virginica
135,136,7.7,3.0,6.1,2.3,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica

In [126]:
iris_df.sort_values(['SepalLengthCm','PetalLengthCm'], ascending = False).head(4)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
131,132,7.9,3.8,6.4,2.0,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
122,123,7.7,2.8,6.7,2.0,Iris-virginica

# isnull()

DataFrame 의 각 element가 null 값인지를 Boolean 형태로 돌려주는 함수

# 피벗 테이블

In [127]:
data = {
        '도시' : ['서울','서울','서울','부산','부산','부산','인천','인천'],
        '연도' : ['2020','2015','2010','2020','2015','2010','2020','2015'],
        '인구' : [9904332,9631487, 9762553, 3448726, 3393194, 3512548, 2890444, 263223],
        '지역' : ['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']}

df1 = pd.DataFrame(data)
df1

   도시    연도       인구   지역
0  서울  2020  9904332  수도권
1  서울  2015  9631487  수도권
2  서울  2010  9762553  수도권
3  부산  2020  3448726  경상권
4  부산  2015  3393194  경상권
5  부산  2010  3512548  경상권
6  인천  2020  2890444  수도권
7  인천  2015   263223  수도권

In [128]:
df1.pivot('도시','연도','인구')

연도       2010       2015       2020
도시
부산  3512548.0  3393194.0  3448726.0
서울  9762553.0  9631487.0  9904332.0
인천        NaN   263223.0  2890444.0

In [129]:
df1.set_index(['도시','연도'])[['인구']].unstack()

           인구
연도       2010       2015       2020
도시
부산  3512548.0  3393194.0  3448726.0
서울  9762553.0  9631487.0  9904332.0
인천        NaN   263223.0  2890444.0

In [130]:
data1 = {
        'key1' : ['A','A','B','B','A'],
        'key2' : ['small','big','small','big','small'],
        'var1' : [1,3,6,9,15],
        'var2' : [100,120,150,180,200]
}
df2 = pd.DataFrame(data1)
df2

  key1   key2  var1  var2
0    A  small     1   100
1    A    big     3   120
2    B  small     6   150
3    B    big     9   180
4    A  small    15   200

In [131]:
#key 1의 값에 따른 var1dml 평균
df2.var1.groupby(df2.key1).mean()

key1
A    6.333333
B    7.500000
Name: var1, dtype: float64

In [132]:
#key1의 값에 따른 var 1 ,var 2의 평균
df2.groupby(df2.key1).mean()

          var1   var2
key1
A     6.333333  140.0
B     7.500000  165.0

# 실습
-iris 데이터에서 각 붓꽃의 꽃잎 길이가 해당 품종 내에서 대/중/소 중 어디 해당되는지를 나타내는 칼럼을 추가

-qcut()함수를 사용 : 동일 개수로 나누어 범주를 생성

In [133]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [134]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [135]:
def q3cut(s):
    return pd.qcut(s, 3, labels = ['소','중','대']). astype(str)
    

iris['petal_length_class'] = iris.groupby(iris.species).petal_length.transform(q3cut)

In [136]:
iris.head(10)

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
0,5.1,3.5,1.4,0.2,setosa,소
1,4.9,3.0,1.4,0.2,setosa,소
2,4.7,3.2,1.3,0.2,setosa,소
3,4.6,3.1,1.5,0.2,setosa,중
4,5.0,3.6,1.4,0.2,setosa,소
5,5.4,3.9,1.7,0.4,setosa,대
6,4.6,3.4,1.4,0.3,setosa,소
7,5.0,3.4,1.5,0.2,setosa,중
8,4.4,2.9,1.4,0.2,setosa,소
9,4.9,3.1,1.5,0.1,setosa,중

# 시계열 자료
-인덱스가 날짜 혹은 시간인 데이터

-판다스에서 Datetimeindex 자료형으로 만들어야 함

In [137]:
date_str = ['2020. 1. 1', '2020. 1. 2', '2020. 1. 4', '2020. 1. 8']
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-04', '2020-01-08'], dtype='datetime64[ns]', freq=None)

In [138]:
date_str
idx

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-04', '2020-01-08'], dtype='datetime64[ns]', freq=None)

In [139]:
date_str

['2020. 1. 1', '2020. 1. 2', '2020. 1. 4', '2020. 1. 8']

In [140]:
np.random.seed(0)
s = pd.Series(np.random.randn(4), index = idx)
s

2020-01-01    1.764052
2020-01-02    0.400157
2020-01-04    0.978738
2020-01-08    2.240893
dtype: float64

In [141]:
pd.date_range('2020-1-1','2020-1-30')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30'],
              dtype='datetime64[ns]', freq='D')

In [142]:
pd.date_range('2021-1-1',periods = 12, freq = 'B')

DatetimeIndex(['2021-01-01', '2021-01-04', '2021-01-05', '2021-01-06',
               '2021-01-07', '2021-01-08', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-18'],
              dtype='datetime64[ns]', freq='B')

In [143]:
s = pd.Series(pd.date_range('2020-12-25', periods = 100, freq = 'D'))

In [144]:
s

0    2020-12-25
1    2020-12-26
2    2020-12-27
3    2020-12-28
4    2020-12-29
        ...
95   2021-03-30
96   2021-03-31
97   2021-04-01
98   2021-04-02
99   2021-04-03
Length: 100, dtype: datetime64[ns]

In [145]:
s.dt.year

0     2020
1     2020
2     2020
3     2020
4     2020
      ...
95    2021
96    2021
97    2021
98    2021
99    2021
Length: 100, dtype: int64

In [146]:
s.dt.month

0     12
1     12
2     12
3     12
4     12
      ..
95     3
96     3
97     4
98     4
99     4
Length: 100, dtype: int64

In [147]:
s.dt.day

0     25
1     26
2     27
3     28
4     29
      ..
95    30
96    31
97     1
98     2
99     3
Length: 100, dtype: int64

In [148]:
s.dt.weekday

0     4
1     5
2     6
3     0
4     1
     ..
95    1
96    2
97    3
98    4
99    5
Length: 100, dtype: int64

In [149]:
s.dt.weekend

AttributeError: 'DatetimeProperties' object has no attribute 'weekend'

In [ ]:
s.dt.strftime('%Y년 %m월 %d일')

# 단톡방 과제
-60171100 윤민혁

In [ ]:
df3 = {
    '이름' : ['베트맨','베트맨','헐크','헐크','헐크','아이언맨','아이언맨','아이언맨'],
    '연도' : [2020,2021,2020, 2021, 2022, 2020, 2021, 2022],
    '몸무게' : [93, 95, 204, 220, 245, 167, 155, 190],
    '소속' : ['DC코믹스','DC코믹스','마블코믹스','마블코믹스','마블코믹스','마블코믹스','마블코믹스','마블코믹스']
}
df4 = pd.DataFrame(df3)
df4

In [ ]:
df4_home = df4.pivot('이름','연도','몸무게')
df4_home

In [ ]:
df4_1 = df4_home.dropna(axis = 1)
df4_1

In [ ]:
df4_1.to_csv('./data/df4_1.csv')

In [ ]:
np.random.seed(0)
df = pd.DataFrame({
    'date' : pd.date_range('2021-1-1', periods = 100, freq = 'D'),
    'value' : np.random.randint(100, size = 100,)
})
df

In [ ]:
month = df.date.dt.month
df.groupby(month).sum()

In [ ]:
titanic = sns.load_dataset('titanic')

In [ ]:
titanic

In [ ]:
titanic['age'].max()

In [ ]:
def q3cut(s):
    return pd.qcut(s, 3, labels = ['아이','성인','장년'])